In [17]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [18]:
X = iris.drop(labels='species', axis=1)
X.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

In [19]:
X.shape

(150, 4)

In [20]:
y = iris['species']
y.head(3)

0    setosa
1    setosa
2    setosa
Name: species, dtype: object

In [21]:
y.shape

(150,)

## Titanic

In [22]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
X = titanic.drop('survived', axis=1)
X.shape

(891, 14)

In [26]:
Y = titanic['survived']
Y.shape

(891,)